4ms/mp1-boot/third-party/CMSIS/Device/ST/STM32MP1xx/Include/stm32mp135dxx_ca7_regs08.h
/****************  Bit definition for USBPHYC_TUNE2 register  ****************/
#define USBPHYC_TUNE2_INCURREN_Pos       (0U)
#define USBPHYC_TUNE2_INCURREN_Msk       (0x1UL << USBPHYC_TUNE2_INCURREN_Pos)           /*!< 0x00000001 */
#define USBPHYC_TUNE2_INCURREN           USBPHYC_TUNE2_INCURREN_Msk                     /*!< The bit enables the current boosting function. */
#define USBPHYC_TUNE2_INCURRINT_Pos      (1U)
#define USBPHYC_TUNE2_INCURRINT_Msk      (0x1UL << USBPHYC_TUNE2_INCURRINT_Pos)          /*!< 0x00000002 */
#define USBPHYC_TUNE2_INCURRINT          USBPHYC_TUNE2_INCURRINT_Msk                    /*!< Current boosting value */
#define USBPHYC_TUNE2_LFSCAPEN_Pos       (2U)
#define USBPHYC_TUNE2_LFSCAPEN_Msk       (0x1UL << USBPHYC_TUNE2_LFSCAPEN_Pos)           /*!< 0x00000004 */
#define USBPHYC_TUNE2_LFSCAPEN           USBPHYC_TUNE2_LFSCAPEN_Msk                     /*!< Low full speed enable */
#define USBPHYC_TUNE2_HSDRVSLEW_Pos      (3U)
#define USBPHYC_TUNE2_HSDRVSLEW_Msk      (0x1UL << USBPHYC_TUNE2_HSDRVSLEW_Pos)          /*!< 0x00000008 */
#define USBPHYC_TUNE2_HSDRVSLEW          USBPHYC_TUNE2_HSDRVSLEW_Msk                    /*!< HS driver slew rate */
#define USBPHYC_TUNE2_HSDRVDCCUR_Pos     (4U)
#define USBPHYC_TUNE2_HSDRVDCCUR_Msk     (0x1UL << USBPHYC_TUNE2_HSDRVDCCUR_Pos)         /*!< 0x00000010 */
#define USBPHYC_TUNE2_HSDRVDCCUR         USBPHYC_TUNE2_HSDRVDCCUR_Msk                   /*!< HS driver DC level */
#define USBPHYC_TUNE2_HSDRVDCLEV_Pos     (5U)
#define USBPHYC_TUNE2_HSDRVDCLEV_Msk     (0x1UL << USBPHYC_TUNE2_HSDRVDCLEV_Pos)         /*!< 0x00000020 */
#define USBPHYC_TUNE2_HSDRVDCLEV         USBPHYC_TUNE2_HSDRVDCLEV_Msk                   /*!< HS driver DC level */
#define USBPHYC_TUNE2_HSDRVCURINCR_Pos   (6U)
#define USBPHYC_TUNE2_HSDRVCURINCR_Msk   (0x1UL << USBPHYC_TUNE2_HSDRVCURINCR_Pos)       /*!< 0x00000040 */
#define USBPHYC_TUNE2_HSDRVCURINCR       USBPHYC_TUNE2_HSDRVCURINCR_Msk                 /*!< Enable the HS driver current increase feature */
#define USBPHYC_TUNE2_FSDRVRFADJ_Pos     (7U)
#define USBPHYC_TUNE2_FSDRVRFADJ_Msk     (0x1UL << USBPHYC_TUNE2_FSDRVRFADJ_Pos)         /*!< 0x00000080 */
#define USBPHYC_TUNE2_FSDRVRFADJ         USBPHYC_TUNE2_FSDRVRFADJ_Msk                   /*!< Tuning pin to adjust the full speed rise/fall time */
#define USBPHYC_TUNE2_HSDRVRFRED_Pos     (8U)
#define USBPHYC_TUNE2_HSDRVRFRED_Msk     (0x1UL << USBPHYC_TUNE2_HSDRVRFRED_Pos)         /*!< 0x00000100 */
#define USBPHYC_TUNE2_HSDRVRFRED         USBPHYC_TUNE2_HSDRVRFRED_Msk                   /*!< High-speed rise-fall reduction enable */
#define USBPHYC_TUNE2_HSDRVCHKITRM_Pos   (9U)
#define USBPHYC_TUNE2_HSDRVCHKITRM_Msk   (0xFUL << USBPHYC_TUNE2_HSDRVCHKITRM_Pos)       /*!< 0x00001E00 */
#define USBPHYC_TUNE2_HSDRVCHKITRM       USBPHYC_TUNE2_HSDRVCHKITRM_Msk                 /*!< HS driver choke current trim */
#define USBPHYC_TUNE2_HSDRVCHKITRM_0     (0x1UL << USBPHYC_TUNE2_HSDRVCHKITRM_Pos)     /*!< 0x00000200 */
#define USBPHYC_TUNE2_HSDRVCHKITRM_1     (0x2UL << USBPHYC_TUNE2_HSDRVCHKITRM_Pos)     /*!< 0x00000400 */
#define USBPHYC_TUNE2_HSDRVCHKITRM_2     (0x4UL << USBPHYC_TUNE2_HSDRVCHKITRM_Pos)     /*!< 0x00000800 */
#define USBPHYC_TUNE2_HSDRVCHKITRM_3     (0x8UL << USBPHYC_TUNE2_HSDRVCHKITRM_Pos)    /*!< 0x00001000 */
#define USBPHYC_TUNE2_HSDRVCHKZTRM_Pos   (13U)
#define USBPHYC_TUNE2_HSDRVCHKZTRM_Msk   (0x3UL << USBPHYC_TUNE2_HSDRVCHKZTRM_Pos)       /*!< 0x00006000 */
#define USBPHYC_TUNE2_HSDRVCHKZTRM       USBPHYC_TUNE2_HSDRVCHKZTRM_Msk                 /*!< HS driver choke impedance trim */
#define USBPHYC_TUNE2_HSDRVCHKZTRM_0     (0x1UL << USBPHYC_TUNE2_HSDRVCHKZTRM_Pos)    /*!< 0x00002000 */
#define USBPHYC_TUNE2_HSDRVCHKZTRM_1     (0x2UL << USBPHYC_TUNE2_HSDRVCHKZTRM_Pos)    /*!< 0x00004000 */
#define USBPHYC_TUNE2_OTPCOMP_Pos        (15U)
#define USBPHYC_TUNE2_OTPCOMP_Msk        (0x1FUL << USBPHYC_TUNE2_OTPCOMP_Pos)           /*!< 0x000F8000 */
#define USBPHYC_TUNE2_OTPCOMP            USBPHYC_TUNE2_OTPCOMP_Msk                      /*!< OTP compensation code */
#define USBPHYC_TUNE2_OTPCOMP_0          (0x1UL << USBPHYC_TUNE2_OTPCOMP_Pos)         /*!< 0x00008000 */
#define USBPHYC_TUNE2_OTPCOMP_1          (0x2UL << USBPHYC_TUNE2_OTPCOMP_Pos)        /*!< 0x00010000 */
#define USBPHYC_TUNE2_OTPCOMP_2          (0x4UL << USBPHYC_TUNE2_OTPCOMP_Pos)        /*!< 0x00020000 */
#define USBPHYC_TUNE2_OTPCOMP_3          (0x8UL << USBPHYC_TUNE2_OTPCOMP_Pos)        /*!< 0x00040000 */
#define USBPHYC_TUNE2_OTPCOMP_4          (0x10UL << USBPHYC_TUNE2_OTPCOMP_Pos)        /*!< 0x00080000 */
#define USBPHYC_TUNE2_SQLCHCTL_Pos       (20U)
#define USBPHYC_TUNE2_SQLCHCTL_Msk       (0x3UL << USBPHYC_TUNE2_SQLCHCTL_Pos)           /*!< 0x00300000 */
#define USBPHYC_TUNE2_SQLCHCTL           USBPHYC_TUNE2_SQLCHCTL_Msk                     /*!< Squelch control */
#define USBPHYC_TUNE2_SQLCHCTL_0         (0x1UL << USBPHYC_TUNE2_SQLCHCTL_Pos)      /*!< 0x00100000 */
#define USBPHYC_TUNE2_SQLCHCTL_1         (0x2UL << USBPHYC_TUNE2_SQLCHCTL_Pos)      /*!< 0x00200000 */
#define USBPHYC_TUNE2_HDRXGNEQEN_Pos     (22U)
#define USBPHYC_TUNE2_HDRXGNEQEN_Msk     (0x1UL << USBPHYC_TUNE2_HDRXGNEQEN_Pos)         /*!< 0x00400000 */
#define USBPHYC_TUNE2_HDRXGNEQEN         USBPHYC_TUNE2_HDRXGNEQEN_Msk                   /*!< Enable HS Rx gain equalizer */
#define USBPHYC_TUNE2_HSRXOFF_Pos        (23U)
#define USBPHYC_TUNE2_HSRXOFF_Msk        (0x3UL << USBPHYC_TUNE2_HSRXOFF_Pos)            /*!< 0x01800000 */
#define USBPHYC_TUNE2_HSRXOFF            USBPHYC_TUNE2_HSRXOFF_Msk                      /*!< HS receiver offset adjustment */
#define USBPHYC_TUNE2_HSRXOFF_0          (0x1UL << USBPHYC_TUNE2_HSRXOFF_Pos)       /*!< 0x00800000 */
#define USBPHYC_TUNE2_HSRXOFF_1          (0x2UL << USBPHYC_TUNE2_HSRXOFF_Pos)      /*!< 0x01000000 */
#define USBPHYC_TUNE2_HSFALLPREEM_Pos    (25U)
#define USBPHYC_TUNE2_HSFALLPREEM_Msk    (0x1UL << USBPHYC_TUNE2_HSFALLPREEM_Pos)        /*!< 0x02000000 */
#define USBPHYC_TUNE2_HSFALLPREEM        USBPHYC_TUNE2_HSFALLPREEM_Msk                  /*!< HS fall time pre-emphasis */
#define USBPHYC_TUNE2_SHTCCTCTLPROT_Pos  (26U)
#define USBPHYC_TUNE2_SHTCCTCTLPROT_Msk  (0x1UL << USBPHYC_TUNE2_SHTCCTCTLPROT_Pos)      /*!< 0x04000000 */
#define USBPHYC_TUNE2_SHTCCTCTLPROT      USBPHYC_TUNE2_SHTCCTCTLPROT_Msk                /*!< Short circuit control protection */
#define USBPHYC_TUNE2_STAGSEL_Pos        (27U)
#define USBPHYC_TUNE2_STAGSEL_Msk        (0x1UL << USBPHYC_TUNE2_STAGSEL_Pos)            /*!< 0x08000000 */
#define USBPHYC_TUNE2_STAGSEL            USBPHYC_TUNE2_STAGSEL_Msk                      /*!< Staggering selection */

/****************  Bit definition for USBPHYC_VERR register  *****************/
#define USBPHYC_VERR_MINREV_Pos          (0U)
#define USBPHYC_VERR_MINREV_Msk          (0xFUL << USBPHYC_VERR_MINREV_Pos)              /*!< 0x0000000F */
#define USBPHYC_VERR_MINREV              USBPHYC_VERR_MINREV_Msk                        /*!< Minor revision */
#define USBPHYC_VERR_MINREV_0            (0x1UL << USBPHYC_VERR_MINREV_Pos)              /*!< 0x00000001 */
#define USBPHYC_VERR_MINREV_1            (0x2UL << USBPHYC_VERR_MINREV_Pos)              /*!< 0x00000002 */
#define USBPHYC_VERR_MINREV_2            (0x4UL << USBPHYC_VERR_MINREV_Pos)              /*!< 0x00000004 */
#define USBPHYC_VERR_MINREV_3            (0x8UL << USBPHYC_VERR_MINREV_Pos)              /*!< 0x00000008 */
#define USBPHYC_VERR_MAJREV_Pos          (4U)
#define USBPHYC_VERR_MAJREV_Msk          (0xFUL << USBPHYC_VERR_MAJREV_Pos)              /*!< 0x000000F0 */
#define USBPHYC_VERR_MAJREV              USBPHYC_VERR_MAJREV_Msk                        /*!< Major revision */
#define USBPHYC_VERR_MAJREV_0            (0x1UL << USBPHYC_VERR_MAJREV_Pos)             /*!< 0x00000010 */
#define USBPHYC_VERR_MAJREV_1            (0x2UL << USBPHYC_VERR_MAJREV_Pos)             /*!< 0x00000020 */
#define USBPHYC_VERR_MAJREV_2            (0x4UL << USBPHYC_VERR_MAJREV_Pos)             /*!< 0x00000040 */
#define USBPHYC_VERR_MAJREV_3            (0x8UL << USBPHYC_VERR_MAJREV_Pos)             /*!< 0x00000080 */

/**
  * @}
  */
/**
  * @}
  */

/**
  * @}
  */
